app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)
	  @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "WE just talking"], ["body", "about the only thing"], ["created_at", "2016-03-21 00:55:38.042266"], ["updated_at", "2016-03-21 00:55:38.042266"]]

	def destroy
		article = Article.find(params[:id])
		article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 6]]